In [2]:
import pandas as pd
import numpy as np

In [4]:
dataset_main = pd.read_json("data.json")
dataset_main

     name   age profession   income        city
0    Arif  28.0   Engineer  55000.0       Dhaka
1  Nusrat  24.0   Designer  48000.0  Chittagong
2   Rafiq  35.0    Teacher  39000.0    Rajshahi
3    Mina  30.0     Doctor  75000.0       Dhaka
4   Hasan  27.0   Engineer  58000.0      Khulna
5   Sadia  26.0   Designer  47000.0      Sylhet
6   Rahim  31.0    Teacher      NaN       Dhaka
7    Rina   NaN     Doctor  72000.0     Barisal
8   Jamil  29.0   Engineer  60000.0  Chittagong
9   Farah  25.0   Designer  49000.0      Khulna

In [6]:
print(dataset_main.head(3))

     name   age profession   income        city
0    Arif  28.0   Engineer  55000.0       Dhaka
1  Nusrat  24.0   Designer  48000.0  Chittagong
2   Rafiq  35.0    Teacher  39000.0    Rajshahi

In [7]:
print(dataset_main.tail(3))

    name   age profession   income        city
7   Rina   NaN     Doctor  72000.0     Barisal
8  Jamil  29.0   Engineer  60000.0  Chittagong
9  Farah  25.0   Designer  49000.0      Khulna

In [12]:
print(dataset_main.columns)

Index(['name', 'age', 'profession', 'income', 'city'], dtype='object')

In [ ]:
print(list(dataset_main.columns))

['name', 'age', 'profession', 'income', 'city']

In [13]:
print(dataset_main.columns[2])

profession

In [14]:
print(dataset_main.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        10 non-null     object
 1   age         9 non-null      float64
 2   profession  10 non-null     object
 3   income      9 non-null      float64
 4   city        10 non-null     object
dtypes: float64(2), object(3)
memory usage: 532.0+ bytes
None

In [17]:
print(dataset_main.shape)

(10, 5)

In [18]:
print(dataset_main.dtypes)

name           object
age           float64
profession     object
income        float64
city           object
dtype: object

In [19]:
print(dataset_main.describe())

             age        income
count   9.000000      9.000000
mean   28.333333  55888.888889
std     3.391165  11836.853936
min    24.000000  39000.000000
25%    26.000000  48000.000000
50%    28.000000  55000.000000
75%    30.000000  60000.000000
max    35.000000  75000.000000

In [20]:
print(dataset_main.index)

RangeIndex(start=0, stop=10, step=1)

In [21]:
print(dataset_main.values)

[['Arif' 28.0 'Engineer' 55000.0 'Dhaka']
 ['Nusrat' 24.0 'Designer' 48000.0 'Chittagong']
 ['Rafiq' 35.0 'Teacher' 39000.0 'Rajshahi']
 ['Mina' 30.0 'Doctor' 75000.0 'Dhaka']
 ['Hasan' 27.0 'Engineer' 58000.0 'Khulna']
 ['Sadia' 26.0 'Designer' 47000.0 'Sylhet']
 ['Rahim' 31.0 'Teacher' nan 'Dhaka']
 ['Rina' nan 'Doctor' 72000.0 'Barisal']
 ['Jamil' 29.0 'Engineer' 60000.0 'Chittagong']
 ['Farah' 25.0 'Designer' 49000.0 'Khulna']]